In [ ]:
import mysql.connector
from mysql.connector import errorcode
import pandas as pd

In [ ]:
# 1 y 2. Crea un nuevo "schema" llamado "alumnas-promo-X"

cnx = mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1')

mycursor = cnx.cursor()

mycursor.execute("CREATE DATABASE IF NOT EXISTS BBDD_alumnas_promo_c")

cnx.close()

In [ ]:
# 3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

cnx = mysql.connector.connect(user = 'root', password = 'AlumnaAdalab', host = '127.0.0.1', database = 'BBDD_alumnas_promo_c')
mycursor = cnx.cursor()

query = 'CREATE TABLE IF NOT EXISTS alumnas(id_alumna INT, nombre VARCHAR(255), apellidos VARCHAR(255), ciudad VARCHAR(50), telefono VARCHAR(10))' 

mycursor.execute(query)

In [ ]:
# 4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior 

mycursor = cnx.cursor()

query = "INSERT INTO alumnas (id_alumna, nombre, apellidos, ciudad, telefono) VALUES (%s,%s,%s,%s,%s)"
val = [
    (1, 'Brigitte', 'Manrique', 'Madrid', '652 251'),
    (2, 'Melissa', 'Montoya', 'Valencia', '623 241'),
    (3, 'Almu', 'Hernandez', 'Madrid', '625 512'),
    (4, 'Fatina', 'Lopez', 'Sevilla', '685 521'),
    (5, 'Laura', 'Torres', 'Caceres', '652 235'),
    (6, 'Juana', 'Calle', 'Valencia', '645 581'),
    (7, 'Ana', 'Rojas', 'Cuenca', '685 439'),
    (8, 'Lucia', 'Baez', 'Bilbao', '698 246'),
    (9, 'Gimena', 'Gimenez', 'Gijon', '645 431'),
    (10, 'Angie', 'Toledo', 'Cordoba', '666 999')
]

mycursor.executemany(query, val)
cnx.commit()
print(val)

[(1, 'Brigitte', 'Manrique', 'Madrid', '652 251'), (2, 'Melissa', 'Montoya', 'Valencia', '623 241'), (3, 'Almu', 'Hernandez', 'Madrid', '625 512'), (4, 'Fatina', 'Lopez', 'Sevilla', '685 521'), (5, 'Laura', 'Torres', 'Caceres', '652 235'), (6, 'Juana', 'Calle', 'Valencia', '645 581'), (7, 'Ana', 'Rojas', 'Cuenca', '685 439'), (8, 'Lucia', 'Baez', 'Bilbao', '698 246'), (9, 'Gimena', 'Gimenez', 'Gijon', '645 431'), (10, 'Angie', 'Toledo', 'Cordoba', '666 999')]

In [ ]:
# 5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" 
mycursor = cnx.cursor()

mycursor.execute('SELECT * FROM alumnas')

registro_alumnas = mycursor.fetchall()          

print(registro_alumnas)

[('1', 'Brigitte', 'Manrique', 'Madrid', '652 251'), ('2', 'Melissa', 'Montoya', 'Valencia', '6253 241'), ('3', 'Almu', 'Hernandez', 'Madrid', '625 512'), ('4', 'Fatina', 'Lopez', 'Sevilla', '685 521'), ('5', 'Laura', 'Torres', 'Caceres', '652 235'), ('6', 'Juana', 'Calle', 'Valencia', '645 581'), ('7', 'Ana', 'Rojas', 'Cuenca', '685 439'), ('8', 'Lucia', 'Baez', 'Bilbao', '698 246'), ('9', 'Gimena', 'Gimenez', 'Gijon', '645 431'), ('10', 'Angie', 'Toledo', 'Cordoba', '666 999'), ('1', 'Brigitte', 'Manrique', 'Madrid', '652 251'), ('2', 'Melissa', 'Montoya', 'Valencia', '623 241'), ('3', 'Almu', 'Hernandez', 'Madrid', '625 512'), ('4', 'Fatina', 'Lopez', 'Sevilla', '685 521'), ('5', 'Laura', 'Torres', 'Caceres', '652 235'), ('6', 'Juana', 'Calle', 'Valencia', '645 581'), ('7', 'Ana', 'Rojas', 'Cuenca', '685 439'), ('8', 'Lucia', 'Baez', 'Bilbao', '698 246'), ('9', 'Gimena', 'Gimenez', 'Gijon', '645 431'), ('10', 'Angie', 'Toledo', 'Cordoba', '666 999'), ('1', 'Brigitte', 'Manrique', 'Madrid', '652 251'), ('2', 'Melissa', 'Montoya', 'Valencia', '623 241'), ('3', 'Almu', 'Hernandez', 'Madrid', '625 512'), ('4', 'Fatina', 'Lopez', 'Sevilla', '685 521'), ('5', 'Laura', 'Torres', 'Caceres', '652 235'), ('6', 'Juana', 'Calle', 'Valencia', '645 581'), ('7', 'Ana', 'Rojas', 'Cuenca', '685 439'), ('8', 'Lucia', 'Baez', 'Bilbao', '698 246'), ('9', 'Gimena', 'Gimenez', 'Gijon', '645 431'), ('10', 'Angie', 'Toledo', 'Cordoba', '666 999'), ('1', 'Brigitte', 'Manrique', 'Madrid', '652 251'), ('2', 'Melissa', 'Montoya', 'Valencia', '623 241'), ('3', 'Almu', 'Hernandez', 'Madrid', '625 512'), ('4', 'Fatina', 'Lopez', 'Sevilla', '685 521'), ('5', 'Laura', 'Torres', 'Caceres', '652 235'), ('6', 'Juana', 'Calle', 'Valencia', '645 581'), ('7', 'Ana', 'Rojas', 'Cuenca', '685 439'), ('8', 'Lucia', 'Baez', 'Bilbao', '698 246'), ('9', 'Gimena', 'Gimenez', 'Gijon', '645 431'), ('10', 'Angie', 'Toledo', 'Cordoba', '666 999')]

In [ ]:
# 5. y conviértelo en Dataframe 

df = pd.DataFrame(registro_alumnas, columns = ['id_alumna', 'nombre', 'apellidos', 'ciudad', 'telefono'])

In [ ]:
df.head(10)

  id_alumna    nombre  apellidos    ciudad  telefono
0         1  Brigitte   Manrique    Madrid   652 251
1         2   Melissa    Montoya  Valencia  6253 241
2         3      Almu  Hernandez    Madrid   625 512
3         4    Fatina      Lopez   Sevilla   685 521
4         5     Laura     Torres   Caceres   652 235
5         6     Juana      Calle  Valencia   645 581
6         7       Ana      Rojas    Cuenca   685 439
7         8     Lucia       Baez    Bilbao   698 246
8         9    Gimena    Gimenez     Gijon   645 431
9        10     Angie     Toledo   Cordoba   666 999

In [ ]:
# 6. Muestra los 3 primeros y  del Dataframe.

df.head(3)

  id_alumna    nombre  apellidos    ciudad  telefono
0         1  Brigitte   Manrique    Madrid   652 251
1         2   Melissa    Montoya  Valencia  6253 241
2         3      Almu  Hernandez    Madrid   625 512

In [ ]:
df.tail(3)

   id_alumna  nombre apellidos   ciudad telefono
37         8   Lucia      Baez   Bilbao  698 246
38         9  Gimena   Gimenez    Gijon  645 431
39        10   Angie    Toledo  Cordoba  666 999

In [ ]:
# 7. consulta para extraer las diferentes ciudades en las que hay alumnas.

mycursor = cnx.cursor()

mycursor.execute ('SELECT DISTINCT ciudad FROM alumnas')

registro_ciudad = mycursor.fetchall()

df = pd.DataFrame(registro_ciudad, columns= ['ciudad'])

cnx.commit()

In [ ]:
df.head()

     ciudad
0    Madrid
1  Valencia
2   Sevilla
3   Caceres
4    Cuenca

In [ ]:
# 8. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).

mycursor = cnx.cursor()

alumnas_madrid = "SELECT * FROM alumnas WHERE ciudad = 'Madrid'"
mycursor.execute(alumnas_madrid) 
alumnas_madrid = mycursor.fetchall()
df_madrid = pd.DataFrame(alumnas_madrid, columns= ['id_alumna', 'nombre', 'apellidos', 'ciudad', 'telefono'])
cnx.commit()

alumnas_valencia = "SELECT * FROM alumnas WHERE ciudad = 'Valencia'"
mycursor.execute(alumnas_valencia) 
alumnas_valencia= mycursor.fetchall()
df_valencia = pd.DataFrame(alumnas_valencia, columns= ['id_alumna', 'nombre', 'apellidos', 'ciudad', 'telefono'])
cnx.commit()

In [ ]:
df_madrid.head(2)

  id_alumna    nombre  apellidos  ciudad telefono
0         1  Brigitte   Manrique  Madrid  652 251
1         3      Almu  Hernandez  Madrid  625 512

In [ ]:
df_valencia.head(2)

  id_alumna   nombre apellidos    ciudad  telefono
0         2  Melissa   Montoya  Valencia  6253 241
1         6    Juana     Calle  Valencia   645 581

In [ ]:
cnx.close()